БИТУправление_медицинским_центром_демо/src/Documents/Рекламация/Рекламация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рекламация</name>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметРекламации</name>
    <type>
      <types>DefinedType.ПредметРекламации</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительНовый</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отклонена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезСкидок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/Рекламация/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Работы") Тогда
			Для Каждого СтрокаРабот Из ДанныеЗаполнения.Работы Цикл
				ЗаполнитьЗначенияСвойств(Работы.Добавить(), СтрокаРабот);
			КонецЦикла;
			Работы.ЗагрузитьКолонку(Работы.ВыгрузитьКолонку("Сумма"), "СуммаБезСкидок");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЭтотОбъект.Отклонена Тогда 
		ЭтотОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьДвиженияПоЗаказуНаПроизводство");
	КонецЕсли;
	
	Если ТипЗнч(ЭтотОбъект.ПредметРекламации) = Тип("ДокументСсылка.КомплексныйРасчетКлиента") Тогда
		Если ЭтотОбъект.Отклонена Тогда
			Если Не ЭтоНовый() Тогда
				КомплексныеРасчетыКлиентов.ЗаказыНаПроизводствоУдалениеПроведенияОбработчик(ЭтотОбъект, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти
